GB-Link/GB-Link-Switch-LDN/firmware/esp32-c6-bridge/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_LWIP_DHCPS_STATIC_ENTRIES=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
# RISC-V code plus the C6 Wi-Fi libraries push the image past the 1 MB the default
# single-app table allows; the large variant gives 1.5 MB inside the 4 MB part.
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
